<template>
  <div>
    <el-card shadow="never">
      <!-- <div v-if="cur === -1">
      <div class="box" v-for="item in list" :key="item.key" :title="item.text">
        <div class="info" @click="cur = item.key">
          {{ item.text }}
          <a :href="item.link">{{ item.text }}</a>
        </div>
        <div class="time">{{ item.time }}</div>
      </div>
    </div>
    <div v-else>
      <container :title="detail.title" :list="detail.list" />
    </div> -->
      <div>
        <p
          v-for="item in article"
          style="text-indent: 2em; text-align: left; line-height: 2em"
        >
          {{ item.content }}
        </p>
      </div>
    </el-card>
  </div>
</template>

<script lang="ts" setup>
import {
  onMounted,
  onBeforeMount,
  nextTick,
  reactive,
  ref,
  shallowReactive,
  watch
} from "vue";
import container from "./components/container.vue";

defineOptions({
  name: "quakeKnowledge"
});

const cur = ref(-1);
const detail = ref({
  title: "",
  list: []
});
const list = [
  {
    key: 0,
    text: "地震科普 | 地震科学知识之地震灾害有哪些（一）",
    link: "",
    time: "2021-01-20"
  },
  {
    key: 1,
    text: "地震来了怎么办（一）——地震是怎样发生的",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 2,
    text: "地震来了怎么办（二）——应该知道的地震常识",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 3,
    text: "地震来了怎么办（二）——应该知道的地震常识",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 4,
    text: "地震来了怎么办（三）——震级和烈度",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 5,
    text: "地震来了怎么办（四）——我国是多地震的国家",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 6,
    text: "地震来了怎么办（五）——地震能预报吗",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 7,
    text: "地震来了怎么办（六）——怎样做好防震准备预报吗",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 8,
    text: "地震来了怎么办（七）——怎样识别地震宏观前兆",
    link: "",
    time: "2020-09-23"
  },
  {
    key: 9,
    text: "地震来了怎么办（八）——地震来了莫慌乱",
    link: "https://data.earthquake.cn/kpzslm/info/2021/12522072.html",
    time: "2020-09-23"
  }
];
const article = [
  {
    type: "h2",
    content: "1.地球内部结构如何："
  },
  {
    type: "p",
    content: "  地球内部可分为地壳、地幔、地核三个圈层。"
  },
  {
    type: "h2",
    content: "2.什么是地震："
  },
  {
    type: "p",
    content:
      "  地球内部缓慢积累的能量突然释放或人为因素引起的地球表面的振动叫地震。"
  },
  {
    type: "h2",
    content: "3.什么是震源："
  },
  {
    type: "p",
    content: "  地球内部发生地震的地方。"
  },
  {
    type: "h2",
    content: "4.什么叫震中？什么叫震中距？"
  },
  {
    type: "p",
    content:
      "  震源在地面上的投影点称为震中。震中到地面上任何一点的距离称为震中距。"
  },
  {
    type: "h2",
    content: "5.什么是震源深度？何为浅源地震、深源地震、中源地震？"
  },
  {
    type: "p",
    content: "  从震中到震源的垂直距离叫震源深度。"
  },
  {
    type: "p",
    content:
      "  浅源地震震源深度在70公里以内，深源地震震源深度超过300公里，震源深度在70-300公里的为中源地震。"
  },
  {
    type: "h2",
    content: "6.世界上震源深度最深的地震有多深？那些地方深源地震多？"
  },
  {
    type: "p",
    content:
      "  1934年6月9日的印尼苏拉西岛东的地震，震源深度达720公里。 深源地震在环太平洋深海沟地区最多，我国东北部有深源地震、台湾以东海域有中深源地震活动。"
  },
  { type: "text", content: "7.根据成因可将地震分为几种？" },
  { type: "text", content: "  天然地震和人工地震。" },
  {
    type: "text",
    content:
      "  天然地震包括构造地震、火山地震、塌陷地震三类。人工地震有地下核爆炸引起的振动，水库蓄水引起的地震等。"
  },
  { type: "text", content: "8.何为构造地震？有何特点？" },
  {
    type: "text",
    content:
      "  构造地震是由地球内部构造运动导致岩层断裂而引起的天然地震，与地质构造体系关系密切，多分布于地下5—30公里的地壳内。其特点是地震持续时间长，影响范围广，破坏力强，并且有重复性。构造地震占全球地震的90%以上。"
  },
  { type: "text", content: "9.何谓火山地震？" },
  {
    type: "text",
    content:
      "  由于火山爆发而引起的天然地震，火山地震的持续时间短，影响范围小，震源深度不超过10公里。"
  },
  { type: "text", content: "10.何谓陷落地震？" },
  {
    type: "text",
    content: "  天然原因形成的地下岩洞顶盖支撑不住岩层的重压甭塌形成的地震。"
  },
  { type: "text", content: "11.何谓地方震、近震、远震？" },
  {
    type: "text",
    content:
      "  震中距在100公里以内，为地方震，震中距在100公里—1000公里为近震，震中距在1000公里以上的为远震。"
  },
  {
    type: "text",
    content: "12.震级为尺度，何谓有感地震、破坏性地震、大地震、微震？"
  },
  {
    type: "text",
    content:
      "  震级小于3级称微震，震级在3级以上的称有感地震，震级在5级以上的称破坏性地震，震级超过7级的称大地震。"
  },
  { type: "text", content: "13.什么是震级？" },
  {
    type: "text",
    content:
      "震级是表示地震本身大小的等级，它与震源释放能量多少有关，能量越大，震级越大，一次地震只有一个震级。震级相差一级，能量相差33倍。"
  },
  { type: "text", content: "14.何谓地震烈度？影响地震烈度的因素有那些" },
  {
    type: "text",
    content:
      "地震对某一地区的影响和破坏程度称烈度。一般而言，震级越大，烈度就越大。同一次地震，震中距不同烈度就不一样，影响烈度的因素，除了震级、震中距外，还与地址构造，地面建筑物抗震性能等因素有关。 "
  },
  { type: "text", content: "15.何谓地震波？" },
  {
    type: "text",
    content: "地震波是地震发生时产生于地球内部的弹性波，是地震释放能量的方式。"
  },
  { type: "text", content: "16.地震波的种类？" },
  { type: "text", content: "地震波有体波和面波，体波有分为纵波和横波。" },
  { type: "text", content: "17.地震波有何特点？" },
  {
    type: "text",
    content:
      "横波的振动方向与波前进方向垂直，在地面上表现上表现为左右摇晃，纵波振动方向与传播方向一致，在地面上反映了上下跳动（颠、簸）的振动。二者相比，纵波 传播的速度比横波快，所以，一般地震发生后感觉到上下跳动，其次才是左右摇晃。另外，横波振幅比纵波大，破坏力大。横波的水平晃动力是造成建筑物破坏的主 要原因。"
  },
  { type: "text", content: "18.震级和烈度的含义有何不同？" },
  {
    type: "text",
    content:
      "震级反映地震本身的大小，只跟地震释放的能力多少有关，而烈度反映是地面受到的影响和破坏的程度。一次地震只有一个震级，而烈度则各处不同，烈度不仅同震级有关，同时还跟震源深度、震中距的远近以及地震波通过介质条件等多种因素有关。"
  },
  {
    type: "text",
    content: "19.一年中地球上发生多少次地震，破坏性地震有多少？"
  },
  {
    type: "text",
    content:
      "全球每年有五百多万次，其中破坏性地震一千多次，七级以上的大地震十几次。"
  },
  { type: "text", content: "20.地震来了怎么办" },
  {
    type: "text",
    content:
      "我们都知道，地震同刮风、下雨、雷电一样，是一种自然现象、一种客观规律。随着科学技术的进步，人们对地震灾害的预防和应对方法也在不断增强。一旦真的遇到了地震，我们应该怎么办呢？首先，不能惊慌，不要盲动。根据感觉判断地震是大、是小，是近震，还是远震。一般近震是先上下颠动，后左右晃动，而远震是只有前后左右的晃动感。如果是小震或者远震，我们现在居住的房屋基本都具备抗震能力，大可不必慌乱。其次，要采取正确的躲避地震方法。在不同的地方，避震方法有所不同，下面我们讲讲在学校、家里和公共场所如何躲避地震。在学校怎样避震"
  },
  {
    type: "text",
    content:
      "安全提示：１、一切行动听从老师的指挥；２、同学之间要互相照顾，大同学要照顾小同学；３、在课桌下避震，有顺序地撤离，千万不要拥挤。假设我们正在教室里上课，突然发生地震了，该怎么办？首先，我们要伏而待定，蹲下或坐下，头部躲进课桌下，讲台旁，绝不要乱跑。尽量蜷曲身体，降低身体重心。抓住桌腿等牢固的物体。保护头颈、眼睛、掩住口鼻。地震停止后，应当马上在老师指挥下有顺序地撤离，撤离时把书包顶在头上，前后同学要保持一定距离。特别在教室门口、楼梯间等狭促地方，一定要放慢速度，发现有摔倒的同学要相互帮助，并及时通知后面的同学以免发生拥挤。跑到室外后，一定要躲在尽量空旷开阔的地方，周围和头顶没有易掉落物的地方。如果我们在操场或室外时，可原地不动蹲下，双手保护头部，注意避开高大建筑物或危险物。千万不要因忘拿某些东西回到教室去。"
  },
  {
    type: "text",
    content:
      "在家怎样避震：安全提示：１、先躲后跑，不要先跑；　２、往牢固地方躲（床下、开间小的地方，有支撑的地方；）　３、来得及的话先开门，关煤气、电源等。避震时，要根据地震时你所处的位置，就近躲避，震动停止后再撤到安全地方。要躲在结实、不易倾倒、能掩护身体的物体下或它的旁边，如：桌、床等，也可以赶快跑到开间较小、有支撑的房间去，如：厨房、卫生间等。如果来得及，要先打开门，以保证通道畅通；关闭煤气开关、电闸。"
  },
  {
    type: "text",
    content:
      "在避震时，要爬下，使身体重心降到最低，脸朝下，不要压住口鼻，同时抓住身边牢固的物体。也可以蹲下或坐下，尽量把身体卷曲起来。要注意保护头部和颈部，用手护住头部和后颈，有可能时，用身边的物品顶在头上，闭上眼睛，防止异物伤害。"
  },
  { type: "text", content: "21.在公共场所如何避震？" },
  {
    type: "text",
    content:
      "安全提示：１、听从工作人员指挥；ﻪ２、不要急于涌向出口，保持跟前面人的距离；３、如果遇到拥挤，解开领扣，双手交叉胸前，护住胸口。大震发生后，如果附近有应急避难场所，要在大人的引导下赶赴避难场所。地震应急避难场所一般依托公园、绿地、操场、广场建设，里面具备突发应急事件应急的基本功能。比如，应急指挥、应急物资发放、应急棚宿、应急厕所等。地震发生后，还要注意以下几个问题：不要急于拥向楼梯口，容易造成挤踏。不要随便点灯火，因为空气中可能有易燃易爆气体。不要急于打电话，以免线路拥挤，影响救灾指挥通讯。"
  }
];

watch(cur, (newVal, old) => {
  switch (newVal) {
    case 0:
      detail.value.title = "地震科普 | 地震科学知识之地震灾害有哪些（一）";
      detail.value.list = [
        "地震直接灾害是指地震波直接造成的灾害。强烈的震动会导致大量房屋倒塌，造成严重的人员伤亡和经济损失，这就是地震直接灾害，也叫做地震原生灾害。",
        "地震次生灾害是地震造成工程结构、设施和自然环境破坏而引发的火灾、爆炸、瘟疫、有毒有害物质污染，以及对居民生产和生活区造成破坏的水灾、滑坡和泥石流等。",
        "在特定条件下，地震次生灾害的危害可能超越地震直接灾害，成为地震的主要灾害。如1923年日本关东7.9级地震约90%的人员伤亡是由次生火灾造成的。因此，千万要重视地震次生灾害的防治。",
        "强烈地震的发生还会导致其他的负面后果，形成严重的灾害链，可把它称为涟漪效应或衍生灾害。如地震后的抢劫、盗窃等社会治安问题，民众抢购生活物资、企业停产破产等情况，都会加剧地震灾害的损失。",
        "因为地震总是突然发生的，建筑物从开始振动到倒塌的时间间隔十分短暂，加之地震波传播速度很快，不同地方的人们会在较短时间内同时感觉到强烈震动。这是其他如水灾旱灾等自然灾害不能比拟的。"
      ];
      break;

    default:
      break;
  }
});

function defineOptions(arg0: { name: string }) {
  throw new Error("Function not implemented.");
}
</script>
<style lang="scss" scoped>
.box {
  display: flex;
  justify-content: space-around;
  align-items: center;

  .info {
    flex: 1;
    cursor: pointer;
    overflow: hidden;
    text-overflow: ellipsis;
    white-space: nowrap;
    padding: 0 5px;
  }

  .info::before {
    display: inline-block;
    content: "";
    width: 10px;
    height: 10px;
    border-radius: 100%;
    background: #666;
    margin: 0 5px;
  }
}
</style>
